# Homebrew Bundle file for Mac Mini migration
# Generated from your current MacBook Pro setup

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Core CLI tools
brew "bash"
brew "git"
brew "wget"
brew "tree"
brew "tmux"
brew "neovim"

# Shell and terminal enhancements
brew "zsh-syntax-highlighting"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fd"
brew "zoxide"
brew "yazi"

# Development tools
brew "gh"
brew "lazygit"
brew "lazydocker"
brew "s-search"

# Programming languages and tools
brew "python@3.10"
brew "python@3.11"
brew "python@3.13"
brew "node"
brew "npm"
brew "go"
brew "rust"
brew "elixir"
brew "erlang"
brew "openjdk"
brew "maven"

# Java 8 specifically (for compatibility)
cask "temurin8"

# Build tools and libraries
brew "gcc"
brew "cmake"
brew "llvm"
brew "boost"
brew "eigen"
brew "protobuf"

# Database and data tools
brew "sqlite"
brew "hdf5"
brew "netcdf"

# Media and graphics libraries
brew "ffmpeg"
brew "opencv"
brew "imagemagick"
brew "graphviz"

# Networking and security
brew "openssl@3"
brew "libssh2"
brew "gnupg"

# System tools
brew "qemu"

# Casks (GUI applications)
cask "android-studio"
cask "mactex-no-gui"
cask "docker"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "postman"
cask "ghostty"

# Fonts
cask "font-meslo-lg-nerd-font"